Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D28CLD2G.atdf
        <register caption="Color Correction RB OR Register" name="ISC_CC_RB_OR" offset="0x80" rw="RW" size="4">
          <bitfield caption="Blue Gain for Red Component (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="RBGAIN"/>
          <bitfield caption="Red Component Offset (signed 13 bits, 1:12:0)" mask="0x1FFF0000" name="ROFST"/>
        </register>
        <register caption="Color Correction GR GG Register" name="ISC_CC_GR_GG" offset="0x84" rw="RW" size="4">
          <bitfield caption="Red Gain for Green Component (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="GRGAIN"/>
          <bitfield caption="Green Gain for Green Component (signed 12 bits, 1:3:8)" mask="0x0FFF0000" name="GGGAIN"/>
        </register>
        <register caption="Color Correction GB OG Register" name="ISC_CC_GB_OG" offset="0x88" rw="RW" size="4">
          <bitfield caption="Blue Gain for Green Component (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="GBGAIN"/>
          <bitfield caption="Green Component Offset (signed 13 bits, 1:12:0)" mask="0x1FFF0000" name="ROFST"/>
        </register>
        <register caption="Color Correction BR BG Register" name="ISC_CC_BR_BG" offset="0x8C" rw="RW" size="4">
          <bitfield caption="Red Gain for Blue Component (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="BRGAIN"/>
          <bitfield caption="Green Gain for Blue Component (signed 12 bits, 1:3:8)" mask="0x0FFF0000" name="BGGAIN"/>
        </register>
        <register caption="Color Correction BB OB Register" name="ISC_CC_BB_OB" offset="0x90" rw="RW" size="4">
          <bitfield caption="Blue Gain for Blue Component (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="BBGAIN"/>
          <bitfield caption="Blue Component Offset (signed 13 bits, 1:12:0)" mask="0x1FFF0000" name="BOFST"/>
        </register>
        <register caption="Gamma Correction Control Register" name="ISC_GAM_CTRL" offset="0x94" rw="RW" size="4">
          <bitfield caption="Gamma Correction Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Gamma Correction Enable for B Channel" mask="0x00000002" name="BENABLE"/>
          <bitfield caption="Gamma Correction Enable for G Channel" mask="0x00000004" name="GENABLE"/>
          <bitfield caption="Gamma Correction Enable for R Channel" mask="0x00000008" name="RENABLE"/>
        </register>
        <register caption="Gamma Correction Blue Entry" count="64" name="ISC_GAM_BENTRY" offset="0x98" rw="RW" size="4">
          <bitfield caption="Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)" mask="0x000003FF" name="BSLOPE"/>
          <bitfield caption="Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)" mask="0x03FF0000" name="BCONSTANT"/>
        </register>
        <register caption="Gamma Correction Green Entry" count="64" name="ISC_GAM_GENTRY" offset="0x198" rw="RW" size="4">
          <bitfield caption="Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)" mask="0x000003FF" name="GSLOPE"/>
          <bitfield caption="Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)" mask="0x03FF0000" name="GCONSTANT"/>
        </register>
        <register caption="Gamma Correction Red Entry" count="64" name="ISC_GAM_RENTRY" offset="0x298" rw="RW" size="4">
          <bitfield caption="Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)" mask="0x000003FF" name="RSLOPE"/>
          <bitfield caption="Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)" mask="0x03FF0000" name="RCONSTANT"/>
        </register>
        <register caption="Color Space Conversion Control Register" name="ISC_CSC_CTRL" offset="0x398" rw="RW" size="4">
          <bitfield caption="RGB to YCbCr Color Space Conversion Enable" mask="0x00000001" name="ENABLE"/>
        </register>
        <register caption="Color Space Conversion YR, YG Register" name="ISC_CSC_YR_YG" offset="0x39C" rw="RW" size="4">
          <bitfield caption="Reg Gain for Luminance (signed 12 bits 1:3:8)" mask="0x00000FFF" name="YRGAIN"/>
          <bitfield caption="Green Gain for Luminance (signed 12 bits 1:3:8)" mask="0x0FFF0000" name="YGGAIN"/>
        </register>
        <register caption="Color Space Conversion YB, OY Register" name="ISC_CSC_YB_OY" offset="0x3A0" rw="RW" size="4">
          <bitfield caption="Blue Gain for Luminance Component (12 bits signed 1:3:8)" mask="0x00000FFF" name="YBGAIN"/>
          <bitfield caption="Luminance Offset (11 bits signed 1:10:0)" mask="0x07FF0000" name="YOFST"/>
        </register>
        <register caption="Color Space Conversion CBR CBG Register" name="ISC_CSC_CBR_CBG" offset="0x3A4" rw="RW" size="4">
          <bitfield caption="Red Gain for Blue Chrominance (signed 12 bits, 1:3:8)" mask="0x00000FFF" name="CBRGAIN"/>
          <bitfield caption="Green Gain for Blue Chrominance (signed 12 bits 1:3:8)" mask="0x0FFF0000" name="CBGGAIN"/>
        </register>
        <register caption="Color Space Conversion CBB OCB Register" name="ISC_CSC_CBB_OCB" offset="0x3A8" rw="RW" size="4">
          <bitfield caption="Blue Gain for Blue Chrominance (signed 12 bits 1:3:8)" mask="0x00000FFF" name="CBBGAIN"/>
          <bitfield caption="Blue Chrominance Offset (signed 11 bits 1:10:0)" mask="0x07FF0000" name="CBOFST"/>
        </register>
        <register caption="Color Space Conversion CRR CRG Register" name="ISC_CSC_CRR_CRG" offset="0x3AC" rw="RW" size="4">
          <bitfield caption="Red Gain for Red Chrominance (signed 12 bits 1:3:8)" mask="0x00000FFF" name="CRRGAIN"/>
          <bitfield caption="Green Gain for Red Chrominance (signed 12 bits 1:3:8)" mask="0x0FFF0000" name="CRGGAIN"/>
        </register>
        <register caption="Color Space Conversion CRB OCR Register" name="ISC_CSC_CRB_OCR" offset="0x3B0" rw="RW" size="4">
          <bitfield caption="Blue Gain for Red Chrominance (signed 12 bits 1:3:8)" mask="0x00000FFF" name="CRBGAIN"/>
          <bitfield caption="Red Chrominance Offset (signed 11 bits 1:10:0)" mask="0x07FF0000" name="CROFST"/>
        </register>
