Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D28CLD2G.atdf
        <register caption="Key 1 Word Register" count="2" name="TDES_KEY1WR" offset="0x20" rw="W" size="4">
          <bitfield caption="Key 1 Word" mask="0xFFFFFFFF" name="KEY1W"/>
        </register>
        <register caption="Key 2 Word Register" count="2" name="TDES_KEY2WR" offset="0x28" rw="W" size="4">
          <bitfield caption="Key 2 Word" mask="0xFFFFFFFF" name="KEY2W"/>
        </register>
        <register caption="Key 3 Word Register" count="2" name="TDES_KEY3WR" offset="0x30" rw="W" size="4">
          <bitfield caption="Key 3 Word" mask="0xFFFFFFFF" name="KEY3W"/>
        </register>
        <register caption="Input Data Register" count="2" name="TDES_IDATAR" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register" count="2" name="TDES_ODATAR" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register" count="2" name="TDES_IVR" offset="0x60" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="XTEA Rounds Register" name="TDES_XTEA_RNDR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Number of Rounds" mask="0x0000003F" name="XTEA_RNDS"/>
        </register>
      </register-group>
      <value-group caption="Processing Mode" name="TDES_MR__CIPHER">
        <value caption="Decrypts data." name="DECRYPT" value="0"/>
        <value caption="Encrypts data." name="ENCRYPT" value="1"/>
      </value-group>
      <value-group caption="ALGORITHM Mode" name="TDES_MR__TDESMOD">
        <value caption="Single DES processing using Key 1 Registers" name="SINGLE_DES" value="0x0"/>
        <value caption="Triple DES processing using Key 1, Key 2 and Key 3 Registers" name="TRIPLE_DES" value="0x1"/>
        <value caption="XTEA processing using Key 1 and Key 2 Registers" name="XTEA" value="0x2"/>
      </value-group>
      <value-group caption="Start Mode" name="TDES_MR__SMOD">
        <value caption="Manual Mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto Mode" name="AUTO_START" value="0x1"/>
        <value caption="TDES_IDATAR0 accesses only Auto Mode" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Operating Mode" name="TDES_MR__OPMOD">
        <value caption="Electronic Code Book mode" name="ECB" value="0x0"/>
        <value caption="Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="Output Feedback mode" name="OFB" value="0x2"/>
        <value caption="Cipher Feedback mode" name="CFB" value="0x3"/>
      </value-group>
      <value-group caption="Cipher Feedback Data Size" name="TDES_MR__CFBS">
        <value caption="64-bit" name="SIZE_64BIT" value="0x0"/>
        <value caption="32-bit" name="SIZE_32BIT" value="0x1"/>
        <value caption="16-bit" name="SIZE_16BIT" value="0x2"/>
        <value caption="8-bit" name="SIZE_8BIT" value="0x3"/>
      </value-group>
      <value-group caption="Unspecified Register Access (cleared by setting bit TDES_CR.SWRST)" name="TDES_ISR__URAT">
        <value caption="Input Data Register written during data processing when SMOD = 0x2 mode." name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data Register read during data processing." name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode Register written during data processing." name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Write-only register read access." name="WOR_RD_ACCESS" value="0x3"/>
      </value-group>
    </module>
    <module caption="True Random Number Generator" id="6334" name="TRNG" version="K">
      <register-group name="TRNG">
        <register caption="Control Register" name="TRNG_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Enables the TRNG to Provide Random Values" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="Register Write Access Key" mask="0xFFFFFF00" name="WAKEY" values="TRNG_CR__WAKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="TRNG_IER" offset="0x10" rw="W" size="4" atomic-op="set:TRNG_IMR">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="TRNG_IDR" offset="0x14" rw="W" size="4" atomic-op="clear:TRNG_IMR">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="TRNG_IMR" offset="0x18" rw="R" size="4" atomic-op="read:TRNG_IMR">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="TRNG_ISR" offset="0x1C" rw="R" size="4" atomic-op="clear:TRNG_ISR">
          <bitfield caption="Data Ready (cleared on read)" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Output Data Register" name="TRNG_ODATA" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
      </register-group>
      <value-group caption="Register Write Access Key" name="TRNG_CR__WAKEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0x524E47"/>
      </value-group>
    </module>
    <module caption="Two-wire Interface High Speed" id="11210" name="TWIHS" version="ZB">
      <register-group name="TWIHS">
        <register caption="Control Register" name="TWIHS_CR" offset="0x00" rw="W" size="4">
          <mode name="DEFAULT" qualifier="TWIHS_CR.FIFOEN" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="TWIHS_CR.FIFOEN" value="1"/>
          <bitfield caption="Send a START Condition" mask="0x00000001" modes="DEFAULT" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" modes="DEFAULT" name="STOP"/>
          <bitfield caption="TWIHS Master Mode Enabled" mask="0x00000004" modes="DEFAULT" name="MSEN"/>
          <bitfield caption="TWIHS Master Mode Disabled" mask="0x00000008" modes="DEFAULT" name="MSDIS"/>
          <bitfield caption="TWIHS Slave Mode Enabled" mask="0x00000010" modes="DEFAULT" name="SVEN"/>
          <bitfield caption="TWIHS Slave Mode Disabled" mask="0x00000020" modes="DEFAULT" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" modes="DEFAULT" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" modes="DEFAULT" name="SWRST"/>
          <bitfield caption="TWIHS High-Speed Mode Enabled" mask="0x00000100" modes="DEFAULT" name="HSEN"/>
          <bitfield caption="TWIHS High-Speed Mode Disabled" mask="0x00000200" modes="DEFAULT" name="HSDIS"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" modes="DEFAULT" name="SMBEN"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" modes="DEFAULT" name="SMBDIS"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" modes="DEFAULT" name="PECEN"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" modes="DEFAULT" name="PECDIS"/>
          <bitfield caption="PEC Request" mask="0x00004000" modes="DEFAULT" name="PECRQ"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" modes="DEFAULT" name="CLEAR"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" modes="DEFAULT" name="ACMEN"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" modes="DEFAULT" name="ACMDIS"/>
          <bitfield caption="Transmit Holding Register Clear" mask="0x01000000" modes="DEFAULT" name="THRCLR"/>
          <bitfield caption="Lock Clear" mask="0x04000000" modes="DEFAULT" name="LOCKCLR"/>
          <bitfield caption="FIFO Enable" mask="0x10000000" modes="DEFAULT" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x20000000" modes="DEFAULT" name="FIFODIS"/>
          <bitfield caption="Send a START Condition" mask="0x00000001" modes="FIFO_ENABLED" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" modes="FIFO_ENABLED" name="STOP"/>
          <bitfield caption="TWIHS Master Mode Enabled" mask="0x00000004" modes="FIFO_ENABLED" name="MSEN"/>
          <bitfield caption="TWIHS Master Mode Disabled" mask="0x00000008" modes="FIFO_ENABLED" name="MSDIS"/>
          <bitfield caption="TWIHS Slave Mode Enabled" mask="0x00000010" modes="FIFO_ENABLED" name="SVEN"/>
          <bitfield caption="TWIHS Slave Mode Disabled" mask="0x00000020" modes="FIFO_ENABLED" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" modes="FIFO_ENABLED" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" modes="FIFO_ENABLED" name="SWRST"/>
          <bitfield caption="TWIHS High-Speed Mode Enabled" mask="0x00000100" modes="FIFO_ENABLED" name="HSEN"/>
          <bitfield caption="TWIHS High-Speed Mode Disabled" mask="0x00000200" modes="FIFO_ENABLED" name="HSDIS"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" modes="FIFO_ENABLED" name="SMBEN"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" modes="FIFO_ENABLED" name="SMBDIS"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" modes="FIFO_ENABLED" name="PECEN"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" modes="FIFO_ENABLED" name="PECDIS"/>
          <bitfield caption="PEC Request" mask="0x00004000" modes="FIFO_ENABLED" name="PECRQ"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" modes="FIFO_ENABLED" name="CLEAR"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" modes="FIFO_ENABLED" name="ACMEN"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" modes="FIFO_ENABLED" name="ACMDIS"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" modes="FIFO_ENABLED" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" modes="FIFO_ENABLED" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" modes="FIFO_ENABLED" name="TXFLCLR"/>
          <bitfield caption="FIFO Enable" mask="0x10000000" modes="FIFO_ENABLED" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x20000000" modes="FIFO_ENABLED" name="FIFODIS"/>
        </register>
        <register caption="Master Mode Register" name="TWIHS_MMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="TWIHS_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
        </register>
        <register caption="Slave Mode Register" name="TWIHS_SMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Slave Receiver Data Phase NACK enable" mask="0x00000001" name="NACKEN"/>
          <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
          <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
          <bitfield caption="Clock Wait State Disable" mask="0x00000040" name="SCLWSDIS"/>
          <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
          <bitfield caption="Slave Address 1 Enable" mask="0x10000000" name="SADR1EN"/>
          <bitfield caption="Slave Address 2 Enable" mask="0x20000000" name="SADR2EN"/>
          <bitfield caption="Slave Address 3 Enable" mask="0x40000000" name="SADR3EN"/>
          <bitfield caption="Data Matching Enable" mask="0x80000000" name="DATAMEN"/>
        </register>
