Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.7.91/atdf/ATSAMA5D28CLD2G.atdf
        <register caption="UHPHS Host Controller Capability Parameters Register" name="UHPHS_HCCPARAMS" offset="0x08" rw="R" size="4">
          <bitfield caption="64-bit Addressing Capability" mask="0x00000001" name="AC"/>
          <bitfield caption="Programmable Frame List Flag" mask="0x00000002" name="PFLF"/>
          <bitfield caption="Asynchronous Schedule Park Capability" mask="0x00000004" name="ASPC"/>
          <bitfield caption="Isochronous Scheduling Threshold" mask="0x000000F0" name="IST"/>
          <bitfield caption="EHCI Extended Capabilities Pointer" mask="0x0000FF00" name="EECP"/>
        </register>
        <register caption="UHPHS USB Command Register" name="UHPHS_USBCMD" offset="0x10" rw="RW" size="4">
          <bitfield caption="Run/Stop (read/write)" mask="0x00000001" name="RS"/>
          <bitfield caption="Host Controller Reset (read/write)" mask="0x00000002" name="HCRESET"/>
          <bitfield caption="Frame List Size (read/write or read-only)" mask="0x0000000C" name="FLS"/>
          <bitfield caption="Periodic Schedule Enable (read/write)" mask="0x00000010" name="PSE"/>
          <bitfield caption="Asynchronous Schedule Enable (read/write)" mask="0x00000020" name="ASE"/>
          <bitfield caption="Interrupt on Async Advance Doorbell (read/write)" mask="0x00000040" name="IAAD"/>
          <bitfield caption="Light Host Controller Reset (optional) (read/write)" mask="0x00000080" name="LHCR"/>
          <bitfield caption="Asynchronous Schedule Park Mode Count (optional) (read/write or read-only)" mask="0x00000300" name="ASPMC"/>
          <bitfield caption="Asynchronous Schedule Park Mode Enable (optional) (read/write or read-only)" mask="0x00000800" name="ASPME"/>
          <bitfield caption="Interrupt Threshold Control (read/write)" mask="0x00FF0000" name="ITC"/>
        </register>
        <register caption="UHPHS USB Status Register" name="UHPHS_USBSTS" offset="0x14" rw="RW" size="4">
          <bitfield caption="USB Interrupt (read/write clear)" mask="0x00000001" name="USBINT"/>
          <bitfield caption="USB Error Interrupt (read/write clear)" mask="0x00000002" name="USBERRINT"/>
          <bitfield caption="Port Change Detect (read/write clear)" mask="0x00000004" name="PCD"/>
          <bitfield caption="Frame List Rollover (read/write clear)" mask="0x00000008" name="FLR"/>
          <bitfield caption="Host System Error (read/write clear)" mask="0x00000010" name="HSE"/>
          <bitfield caption="Interrupt on Async Advance (read/write clear)" mask="0x00000020" name="IAA"/>
          <bitfield caption="HCHalted (read-only)" mask="0x00001000" name="HCHLT"/>
          <bitfield caption="Reclamation (read-only)" mask="0x00002000" name="RCM"/>
          <bitfield caption="Periodic Schedule Status (read-only)" mask="0x00004000" name="PSS"/>
          <bitfield caption="Asynchronous Schedule Status (read-only)" mask="0x00008000" name="ASS"/>
        </register>
        <register caption="UHPHS USB Interrupt Enable Register" name="UHPHS_USBINTR" offset="0x18" rw="RW" size="4">
          <bitfield caption="USB Interrupt Enable" mask="0x00000001" name="USBIE"/>
          <bitfield caption="USB Error Interrupt Enable" mask="0x00000002" name="USBEIE"/>
          <bitfield caption="Port Change Interrupt Enable" mask="0x00000004" name="PCIE"/>
          <bitfield caption="Frame List Rollover Enable" mask="0x00000008" name="FLRE"/>
          <bitfield caption="Host System Error Enable" mask="0x00000010" name="HSEE"/>
          <bitfield caption="Interrupt on Async Advance Enable" mask="0x00000020" name="IAAE"/>
        </register>
        <register caption="UHPHS USB Frame Index Register" name="UHPHS_FRINDEX" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Frame Index" mask="0x00003FFF" name="FI"/>
        </register>
        <register caption="UHPHS Control Data Structure Segment Register" name="UHPHS_CTRLDSSEGMENT" offset="0x20" rw="RW" size="4"/>
        <register caption="UHPHS Periodic Frame List Base Address Register" name="UHPHS_PERIODICLISTBASE" offset="0x24" rw="RW" size="4">
          <bitfield caption="Base Address (Low)" mask="0xFFFFF000" name="BA"/>
        </register>
        <register caption="UHPHS Asynchronous List Address Register" name="UHPHS_ASYNCLISTADDR" offset="0x28" rw="RW" size="4">
          <bitfield caption="Link Pointer Low" mask="0xFFFFFFE0" name="LPL"/>
        </register>
        <register caption="UHPHS Configured Flag Register" name="UHPHS_CONFIGFLAG" offset="0x50" rw="RW" size="4">
          <bitfield caption="Configure Flag (read/write)" mask="0x00000001" name="CF"/>
        </register>
        <register caption="UHPHS Port Status and Control Register 0" name="UHPHS_PORTSC_0" offset="0x54" rw="RW" size="4">
          <bitfield caption="Current Connect Status (read-only)" mask="0x00000001" name="CCS"/>
          <bitfield caption="Connect Status Change (read/write clear)" mask="0x00000002" name="CSC"/>
          <bitfield caption="Port Enabled/Disabled (read/write)" mask="0x00000004" name="PED"/>
          <bitfield caption="Port Enable/Disable Change (read/write clear)" mask="0x00000008" name="PEDC"/>
          <bitfield caption="Over-current Active (read-only)" mask="0x00000010" name="OCA"/>
          <bitfield caption="Over-current Change (read/write clear)" mask="0x00000020" name="OCC"/>
          <bitfield caption="Force Port Resume (read/write)" mask="0x00000040" name="FPR"/>
          <bitfield caption="Suspend (read/write)" mask="0x00000080" name="SUS"/>
          <bitfield caption="Port Reset (read/write)" mask="0x00000100" name="PR"/>
          <bitfield caption="Line Status (read-only)" mask="0x00000C00" name="LS"/>
          <bitfield caption="Port Power (read/write or read-only)" mask="0x00001000" name="PP"/>
          <bitfield caption="Port Owner (read/write)" mask="0x00002000" name="PO"/>
          <bitfield caption="Port Indicator Control (read/write)" mask="0x0000C000" name="PIC"/>
          <bitfield caption="Port Test Control (read/write)" mask="0x000F0000" name="PTC"/>
          <bitfield caption="Wake on Connect Enable (read/write)" mask="0x00100000" name="WKCNNT_E"/>
          <bitfield caption="Wake on Disconnect Enable (read/write)" mask="0x00200000" name="WKDSCNNT_E"/>
          <bitfield caption="Wake on Over-current Enable (read/write)" mask="0x00400000" name="WKOC_E"/>
        </register>
